DoS Testmessages/CXF-EncSign_originalMessage.xml

<soapenv:Envelope xmlns:cxf="http://cxf.kmzs.ba/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><ds:Signature Id="SIG-65B3639AC82616A6B614740304642667" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="cxf soapenv" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-65B3639AC82616A6B614740304642466"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="cxf" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>qdI+Jak+1ASq8IkDc1HiAdurzzQ=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>PGxwBM/zQI3b5mynIcvgrl3NdWXgZEsHWrTqkRLIGHt/jYtGL7tpjFi+yYEQEPsqjXMktAt8G5I1kdOlcgqV/jmKzLp+Lwh5DcKYH3qN7vFaPcJZucAEIxDlzOZWhFAH38rfJwzLLD3EbkBEpWM+BFZZnO5NF2sdj+xU5jlaZ/iwh7mHD+8YeoD7MGorV0nRR+OmefgMh6scvrk6A+Y6jUFy8NOpXVi9Ug57AQ9SvXW9kSYGi6H+fDTp5GIhU5mjHwqoCho/9vwOn5VSZfKWfyPPCf6vBi6UGzJn62n1VEN/IY6e4ZJi7JRyuX4tJiORhKhLFH4BUdQ3322vujeogA==</ds:SignatureValue><ds:KeyInfo Id="KI-65B3639AC82616A6B614740304642404"><wsse:SecurityTokenReference wsu:Id="STR-65B3639AC82616A6B614740304642405"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=client</ds:X509IssuerName><ds:X509SerialNumber>1034513739</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><xenc:EncryptedKey Id="EK-65B3639AC82616A6B614740304640061" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=server</ds:X509IssuerName><ds:X509SerialNumber>1993907142</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>I0dlFIdbJRo5i9aK2GYpcvm20fG93uqUmBwxYYey+HgZo4RUYZVLLWRk+SLvrjVXvM2iOFs/V3oK3df6e7K3KsGE0rTWlj7iKBdR2PdfZR9BrBYSaNEA5k5cp7LnxUVq4oH8A2RabS9BExP4SCmn2TqQVqyaCKy50Oc0FgRSB9p3WFUZgvF2MBmIO7ZI3aYiQjLoa68CCzNL4xLYl8/R7eaVTmiaqHsFMklc9yIICryaH2KZot+VrKfHedGtgQqZ+cxYRHz6zGTS9A74KDAmlxJeXGoV0h5R/4XQIsrH8wsYFdAm+q+NBT8nGVmOrAo7CgUuzz6L1IeBr8mP+w9row==</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#ED-65B3639AC82616A6B614740304641562"/></xenc:ReferenceList></xenc:EncryptedKey></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-65B3639AC82616A6B614740304642466" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData Id="ED-65B3639AC82616A6B614740304641562" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"><wsse:Reference URI="#EK-65B3639AC82616A6B614740304640061"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>Qv2VZaAji9/gPnImB3el1G12vVzMOKnJqS1cIp3SVLbnyu8vARXjsUvC7j8AQ8VhI8SX5OCNh59BsvvvFvGgnhmfyMUstO5yyI0BI1okaRk=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soapenv:Body>
</soapenv:Envelope>